# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM ERD

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# import pkgs
import pandas as pd
import sqlite3 as sql

In [12]:
# Load db
con = sql.connect('data.sqlite')

NameError: name 'cursor' is not defined

## Select the names of all employees in Boston 

Hint: join the employees and offices tables. Select the first and last name.

In [ ]:
# How do I print a list of tables from a database?

In [13]:
# Your code here

qry = """
SELECT firstname, lastname
FROM employees
JOIN offices
    USING(officeCode)
WHERE city = 'Boston';

"""

pd.read_sql(qry,con)

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by. Select the office code, city, and number of employees.

In [16]:
# Your code here

pd.read_sql("""
SELECT o.officeCode
    , o.city
    , COUNT(e.employeeNumber) AS n_employees
FROM offices as o
LEFT JOIN employees as e
    USING(officeCode)
GROUP BY officeCode

;
""", con)

   officeCode           city  n_employees
0           1  San Francisco            6
1           2         Boston            2
2           3            NYC            2
3           4          Paris            5
4           5          Tokyo            2
5           6         Sydney            4
6           7         London            2
7          27         Boston            0

## Write 3 questions of your own and answer them

In [ ]:
# Answers will vary

# Example question: 
"""
How many customers are there per office?
"""

In [17]:
"""
How many customers are there per office?
"""
q = """
SELECT o.officeCode
    , o.city
    , COUNT(c.customerNumber) AS n_customers
FROM offices AS o
LEFT JOIN customers AS 
    USING(city)
GROUP BY city

;
"""
pd.read_sql(q,con)

DatabaseError: Execution failed on sql '
SELECT o.officeCode
    , o.city
    , COUNT(c.customerNumber) AS n_customers
FROM offices AS o
LEFT JOIN customers AS
    USING(city)
GROUP BY city

;
': near "USING": syntax error

In [ ]:
"""
Question 2
"""

# Your code here

In [ ]:
"""
Question 3
"""

# Your code here

## Level Up 1: Display the names of every individual product that each employee has sold

Hint: You will need to use multiple `JOIN` clauses to connect all the way from employee names to product names.

In [ ]:
# Your code here

## Level Up 2: Display the number of products each employee has sold

Alphabetize the results by employee last name.

Hint: Use the `quantityOrdered` column from `orderDetails`. Also, think about how to group the data when some employees might have the same first or last name.

In [ ]:
# Your code here

## Level Up 3: Display the names employees who have sold more than 200 different products

Hint: this is different from the previous question because the quantity sold doesn't matter, only the number of different products

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!